// 정리
// 핵심 1. STL 라이브러리의 구조 : container, iterator, algorithm 구조
// 1. find 만들기
// 2. slist 만들기
// 3. slist_iterator 만들기

// 핵심 2. dependent name 개념과 "typename" 키워드

// 핵심 3. iterator 이야기

// => s.end() 는 마지막 다음이다.!!
// 
// => 반복자 무효화 현상 - 아주 중요!!!
// 
// => 반복자의 5가지 분류 - 가장 중요!!

// => 반복자의 형태
//    1. 컨테이너에서 꺼내는 반복자       : s.begin()
//    2. 독립적으로 만들어 사용하는 반복자 : 삽입 반복자, 스트림 반복자
//										C++17 파일시스템 반복자

// 내일 : 반복자 이야기 좀더... 
//       std::find 같은 알고리즘에 대해서 깊이 있게 살펴 보는 시간

